#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.ssh_key2: Refreshing state... [id=5d032c44ec0a0627ad8565e0cfd088d38ffd582d]
tls_private_key.ssh_key1: Refreshing state... [id=7da4403c09180fde38f152fe0ee7439c70a986d9]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05MzE4MjkwMS1jZGU2LTRmMGQtOGQ1Mi00YTg2ZjZlNzg5MzA7b2JqZWN0SWQ9ZGYzNTY1ZGMtNDEzZC00NmY1LTg2OTUtOTAyNjFlYjA0ZmUyO3N1YnNjcmlwdGlvbklkPTNmZTM0YzdkLTg0ODYtNGZmZi1hZDEwLWEzYWZjMGNmMDliNTt0ZW5hbnRJZD1mN2YxNmFjMS1jZWNiLTQzODMtYjAxMS04Y2ViZmI5OWUwYmE=]
azurerm_application_security_group.asg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-servers]
azurerm_virtual_network.vnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet]
random_id.random_id2: Refreshing state... [id=QP_qA_X6q5g]
random_id.random_id: Refreshing state... [id=g2kx3oQKPns]
azurerm_public_ip.nic1_ip: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/publicIPAddresses/lt-tf-demo-public-ip]
azurerm_application_security_group.asg2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-databases]
azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv]
azurerm_storage_account.storage_boot_diagnostics: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Storage/storageAccounts/diag836931de840a3e7b]
azurerm_storage_account.storage_boot_diagnostics2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Storage/storageAccounts/diag40ffea03f5faab98]
azurerm_subnet.subnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet/subnets/lt-tf-demo-subnet]
azurerm_subnet.subnet2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet/subnets/lt-tf-demo-subnet2]
azurerm_network_security_group.nsg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_network_interface.nic1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1]
azurerm_network_interface.nic2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2]
azurerm_network_interface_security_group_association.nic1_nsg1_connect: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_network_interface_application_security_group_association.asgnic1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-servers]
azurerm_network_interface_application_security_group_association.asgnic2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-databases]
azurerm_network_interface_security_group_association.nic2_nsg1_connect: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_key_vault_access_policy.kv_policy: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv/objectId/df3565dc-413d-46f5-8695-90261eb04fe2]
data.azurerm_key_vault.kv1: Reading...
data.azurerm_key_vault.kv1: Read complete after 1s [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv]
azurerm_key_vault_secret.privatekey2: Refreshing state... [id=https://lt-tf-demo-kv.vault.azure.net/secrets/lt-tf-demo-vm2-privatekey/2e1b2d6e4d654ce08d40dc9b9554fb83]
azurerm_key_vault_secret.privatekey: Refreshing state... [id=https://lt-tf-demo-kv.vault.azure.net/secrets/lt-tf-demo-vm1-privatekey/6d86951532b54bddae7b91c57ea4ac4e]
azurerm_linux_virtual_machine.vm2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm2]
azurerm_linux_virtual_machine.vm1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm1 will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "vm1" {
        id                              = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm1"
        name                            = "lt-tf-demo-vm1"
      ~ size                            = "Standard_B1s" -> "Standard_B1S"
        tags                            = {}
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.vm2 will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "vm2" {
        id                              = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm2"
        name                            = "lt-tf-demo-vm2"
      ~ size                            = "Standard_B1s" -> "Standard_B1S"
        tags                            = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_subnet.subnet3 will be created
  + resource "azurerm_subnet" "subnet3" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "lt-tf-demo-subnet3"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "lt-tf-demo-rg"
      + virtual_network_name                           = "lt-tf-demo-vnet2"
    }

  # azurerm_virtual_network.vnet2 will be created
  + resource "azurerm_virtual_network" "vnet2" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "lt-tf-demo-vnet2"
      + resource_group_name = "lt-tf-demo-rg"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larstthorsen, Action: `pull_request`*